//  1. Создать репозиторий на GitHub
//  2. Нарисовать блок-схему алгоритма
//  3. Текстовый файл Readme.md 
//  4. Написать программу
//  5. Использовать контроль версий (разные коммиты).

//  Написать программу, которая из имеющегося массива строк
// формирует массив из строк, длина которых меньше либо равна 3 символа.
//  Первоначальный массив можно ввести с клавиатуры, 
//  либо задать на старте выполнения алгоритма. 
//  При решении не рекомендуется пользоваться коллекциями, 
// лучше обойтись исключительно массивами.
